# MoveNext Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregateIterator..::..MoveNext Method
IFCAggregateIterator Class See Also
---
Increments the iterator to the next object in the IFCAggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Return Value
True if there is another available object in this iterator. False if the iterator has completed all available objects.
# See Also
IFCAggregateIterator Class
Autodesk.Revit.DB.IFC Namespace